Case3_3DBR58_FineMesh/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
 (
            alpha
            {
            field alpha.a; //field to initialise
            fields
            (
            z alpha
            );
            lookuptables (
            {
            name inletprofilealpha;
            outOfBounds clamp;
            file "$FOAM_CASE/initial_1D_profile/1DSedim/MATLAB/alpha_a.xy";
            }
            );
            expression "inletprofilealpha(pos().z+0.045)";
            //condition "pos().x <= 10.0  ";
            keepPatches 1;
	    }

            pff
            {
            field pff; //field to initialise
            fields
            (
            z pff
            );
            lookuptables 
            (
            {
            name inletprofilepff;
            outOfBounds clamp;
            file "$FOAM_CASE/initial_1D_profile/1DSedim/MATLAB/pff.xy";
            }
            );
            expression "inletprofilepff(pos().z+0.045)";
            //condition "pos().x <= 10.0  ";
            keepPatches 1;
            }

 );

// ************************************************************************* //







